# Aligned Distribution Rebar Handles Enumeration

Source: https://www.revitapidocs.com/2026/180781a1-de85-a9f1-0b71-f390aecf384c.htm

---

| Aligned Distribution Rebar Handles Enumeration |
| --- |

This enum represents the values that custom handles tags of RebarConstrainedHandle of Rebar Free Form Aligned Distribution has.
 The tag of a \[!:Autodesk::Revit::DB::Structure::RebarHandleType::CustomHandle] RebarConstrainedHandle
 can be obtained by calling the \[!:Autodesk::Revit::DB::Structure::RebarConstrainedHandle::GetCustomHandleTag()]
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public enum AlignedDistributionRebarHandles
```

```
Public Enumeration AlignedDistributionRebarHandles
```

```
public enum class AlignedDistributionRebarHandles
```

```
type AlignedDistributionRebarHandles
```
Members

| Member name | Value | Description |
| --- | --- | --- |
| DistributionPath1 | 1 | Tag for handle representing the Distribution Path 1\. |
| DistributionPath2 | 2 | Tag for handle representing the Distribution Path 2\. |
| EndOfDistributionPath | 4 | Tag for handle representing the End Distribution Path. |
| HostSurface | 0 | Tag for handle representing the Host Surface. |
| SetOrientation | 5 | Tag for handle representing the Set Orientation. |
| StartOfDistributionPath | 3 | Tag for handle representing the Start Distribution Path. |

See Also

#### Reference

Autodesk.Revit.DB.Structure Namespace